//---------------------------------------------------------------------------
#pragma hdrstop

#include "UnitConfigReports.h"
//---------------------------------------------------------------------------
const int CountOfReports = 28;

AnsiString arrTitlesOfReports[CountOfReports] = {
        "Ведомость на группу (Quick)",
        "Договор (Quick)",
        "Экзаменационный (зачетный) лист (Quick)",
        "Протокол заседания экз. комиссии - гос. экзамены (Quick)",
        "Справка (Quick)",
        "Справочная карточка (Quick)",
        "Отчет об оплате на группу за период (MS Word)",
        "Список студентов и номеров договоров (MS Word)",
        "Акт приема-сдачи личных дел студентов (MS Word)",
        "Документ о допуске к вступительным испытаниям (MS Word)",
        "Документ о зачислении абитуриентов на 1-й курс (MS Word)",
        "Сводная ведомость (MS Word)",
        "Ведомость на группу (MS Word)",
        "Отчет для бухгалтерии (оплата представительств за месяц)",
        "Отчет для бухгалтерии (оплата и долги представительств за уч. год)",
        "Отчет для бухгалтерии (оплата представительств за один день)",
        "Отчет для бухгалтерии (оплата и долги представительств за семестр)",
        "Вычисление среднего балла студентов группы (MS Word)",
        "Полный список кандидатов на красный диплом (MS Word)",
        "Академическая справка (MS Word)",
        "Приложение к диплому (MS Word)",
        "Характеристика студента (MS Word)",
        "ОТЧЕТ ДЛЯ БУХГАЛТЕРИИ (MS Excel)",
        "Учебная карточка студента (MS Excel)",
        "Приложение к диплому о неполоном высшем(MS Word)",
        "Форма №3 - (MS Excel)",
        "Статистика по оценкам группы",
        "Статистика"
};

AnsiString arrHintsOfReports[CountOfReports] = {
        "Экзаменационная ведомость на группу",
        "Договор",
        "Экзаменационный (зачетный) лист",
        "Протокол заседания экзаменационной комиссии (гос. экзамены)",
        "Справка, подтверждающая что студент учится в ВУЗе",
        "Справочная карточка студента",
        "Отчет об оплате студентов из выбранной группы за период обучения",
        "Список студентов и соответствующих номеров договоров",
        "Акт приема-сдачи личных дел студентов",
        "Документ о допуске абитуриентов к вступительным испытаниям",
        "Документ о зачислении абитуриентов на 1-й курс",
        "Сводная ведомость об успеваемости в группе",
        "Ведомость на группу",
        "Отчет для бухгалтерии (оплата представительств за месяц)",
        "Отчет для бухгалтерии (оплата и долги представительств за уч. год)",
        "Отчет для бухгалтерии (оплата представительств за один день)",
        "Отчет для бухгалтерии (оплата и долги представительств за семестр)",
        "Вычисление среднего балла студентов группы",
        "Полный список кандидатов на красный диплом",
        "Академическая справка",
        "Приложение к диплому",
        "Характеристика студента",
        "ОТЧЕТ ДЛЯ БУХГАЛТЕРИИ (MS Excel)",
        "Учебная карточка студента (MS Excel)",
        "Приложение к диплому о неполоном высшем(MS Word)",
        "Форма №3 - Для подготовки данных о выданных дипломах дипломированнного специалиста(MS Excel)",
        "Статистика по оценкам группы",
        "Статистика"
};
//---------------------------------------------------------------------------

#pragma package(smart_init)
